In [33]:
import pandas as pd

#### Group By function with Aggregations

In [34]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Salary': [40000, 42000, 50000, 52000, 60000, 58000],
    'Gender':['Male','Female','Female','Male','Male','Male'],
    'Age':  [20,50,24,26,29,50]
}

df = pd.DataFrame(data)

df

  Department Employee  Salary  Gender  Age
0         HR    Alice   40000    Male   20
1         HR      Bob   42000  Female   50
2         IT  Charlie   50000  Female   24
3         IT    David   52000    Male   26
4    Finance      Eva   60000    Male   29
5    Finance    Frank   58000    Male   50

In [35]:
# groupby()
dgroup=df.groupby('Department')   #group of Department
ggroup=df.groupby('Gender')
print(dgroup)
print(ggroup)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002D5FE230490>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002D5FE2306B0>

In [36]:
dgroup['Salary'].sum()

Department
Finance    118000
HR          82000
IT         102000
Name: Salary, dtype: int64

In [37]:
dgroup['Salary'].max()

Department
Finance    60000
HR         42000
IT         52000
Name: Salary, dtype: int64

In [38]:
dgroup['Salary'].min()

Department
Finance    58000
HR         40000
IT         50000
Name: Salary, dtype: int64

In [39]:
dgroup['Salary'].count()

Department
Finance    2
HR         2
IT         2
Name: Salary, dtype: int64

In [40]:
dgroup['Salary'].mean()

Department
Finance    59000.0
HR         41000.0
IT         51000.0
Name: Salary, dtype: float64

In [41]:
#agg() --> its use to perform aggregation operations

dgroup['Salary'].agg(['sum','max','min','mean','count'])

               sum    max    min     mean  count
Department
Finance     118000  60000  58000  59000.0      2
HR           82000  42000  40000  41000.0      2
IT          102000  52000  50000  51000.0      2

In [42]:
dgroup['Salary'].agg(Total_Salary='sum',min_Salary='min'
                     ,Max_Salary='max',Avg_Salary='mean')

            Total_Salary  min_Salary  Max_Salary  Avg_Salary
Department
Finance           118000       58000       60000     59000.0
HR                 82000       40000       42000     41000.0
IT                102000       50000       52000     51000.0

In [43]:
#3. Aggregation on Multiple Columns
dgroup.agg({
    'Salary': ['sum', 'mean'],
    'Employee':['count'],
    'Age':['max','min']
})

            Salary          Employee Age
               sum     mean    count max min
Department
Finance     118000  59000.0        2  50  29
HR           82000  41000.0        2  50  20
IT          102000  51000.0        2  26  24

### Grouping by Multiple Columns

In [44]:
df

  Department Employee  Salary  Gender  Age
0         HR    Alice   40000    Male   20
1         HR      Bob   42000  Female   50
2         IT  Charlie   50000  Female   24
3         IT    David   52000    Male   26
4    Finance      Eva   60000    Male   29
5    Finance    Frank   58000    Male   50

In [49]:
#make group of Department and Gender 
x=df.groupby(['Department', 'Gender'])
x['Salary'].mean()

Department  Gender
Finance     Male      60000
HR          Female    42000
            Male      40000
IT          Female    50000
            Male      52000
Name: Salary, dtype: int64

In [50]:
x['Salary'].max()

Department  Gender
Finance     Male      60000
HR          Female    42000
            Male      40000
IT          Female    50000
            Male      52000
Name: Salary, dtype: int64

In [52]:
x['Salary'].agg(['sum','mean','max','min'])

                      sum     mean    max    min
Department Gender
Finance    Male    118000  59000.0  60000  58000
HR         Female   42000  42000.0  42000  42000
           Male     40000  40000.0  40000  40000
IT         Female   50000  50000.0  50000  50000
           Male     52000  52000.0  52000  52000

In [54]:
df

  Department Employee  Salary  Gender  Age
0         HR    Alice   40000    Male   20
1         HR      Bob   42000  Female   50
2         IT  Charlie   50000  Female   24
3         IT    David   52000    Male   26
4    Finance      Eva   60000    Male   29
5    Finance    Frank   58000    Male   50

In [53]:
# 7. Filtering Groups
# Use .filter() to include/exclude entire groups based on a condition:
# Keep only groups where average salary > 45000
df.groupby('Department').filter(lambda x: x['Salary'].mean() > 45000)

  Department Employee  Salary  Gender  Age
2         IT  Charlie   50000  Female   24
3         IT    David   52000    Male   26
4    Finance      Eva   60000    Male   29
5    Finance    Frank   58000    Male   50

In [58]:
#4.Custom Aggregation Functions

def fun(x):
    return x.min()+10000

df.groupby('Department')['Salary'].agg(min_Salary='min',New_Salary=fun)

            min_Salary  New_Salary
Department
Finance          58000       68000
HR               40000       50000
IT               50000       60000

In [60]:
df

  Department Employee  Salary  Gender  Age
0         HR    Alice   40000    Male   20
1         HR      Bob   42000  Female   50
2         IT  Charlie   50000  Female   24
3         IT    David   52000    Male   26
4    Finance      Eva   60000    Male   29
5    Finance    Frank   58000    Male   50

In [61]:
#You can use .apply() to perform row-wise custom logic per group:

def top_earner(group):
    return group.nlargest(2, 'Salary')   #2 --> top to salary

df.groupby('Department').apply(top_earner)

C:\Users\HP\AppData\Local\Temp\ipykernel_28844\1063773470.py:6: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Department').apply(top_earner)

             Department Employee  Salary  Gender  Age
Department
Finance    4    Finance      Eva   60000    Male   29
           5    Finance    Frank   58000    Male   50
HR         1         HR      Bob   42000  Female   50
           0         HR    Alice   40000    Male   20
IT         3         IT    David   52000    Male   26
           2         IT  Charlie   50000  Female   24